app/controllers/donations_controller.rb

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
SELECT * FROM "donation_options" WHERE ("donation_options"."id" = 3)
INSERT INTO "donations" ("updated_at", "card_type", "story_id", "donation_option_id", "card_expires_on", "first_name", "last_name", "ip_address", "created_at") VALUES('2009-05-17 14:37:20', 'visa', 1, 3, '2009-05-01', 'Shoaib', 'Burq', NULL, '2009-05-17 14:37:20')
---
  def create
    @donation = Donation.new(params[:donation])
    @donation.story = Story.find(session[:current_story])
    @donation.donation_option = DonationOption.find(session[:current_donation_option])
    @donation.ip_address = request.remote_ip

    if @donation.save