app/controllers/donation_options_controller.rb

  def index
    @donation_options = DonationOption.all
---
SELECT * FROM "donation_options"