app/controllers/stories_controller.rb

  def create
    @story = Story.new(params[:story])
    @story.user = current_user
    if @story.save
---
INSERT INTO "stories" ("updated_at", "photo_file_name", "photo_file_size", "title", "body", "public", "photo_updated_at", "photo_content_type", "user_id", "created_at") VALUES('2009-05-15 15:25:39', 'Nomad_1.jpg', 294384, 'Fire', 'bla', 'f', '2009-05-15 15:25:38', 'image/jpeg', 1, '2009-05-15 15:25:39')

  def edit
    @story = Story.find(params[:id])
---
SELECT * FROM "stories" WHERE ("stories"."id" = 3)

  def update
    @story = Story.find(params[:id])
    if @story.update_attributes(params[:story])
---
SELECT * FROM "stories" WHERE ("stories"."id" = 3)
UPDATE "stories" SET "public" = 't', "body" = 'Rails 2.3 delivers a variety of new and improved features, including pervasive Rack integration, refreshed support for Rails Engines, nested transactions for Active Record, dynamic and default scopes, unified rendering, more efficient routing, application templates, and quiet backtraces. This list covers the major upgrades, but doesn’t include every little bug fix and change. If you want to see everything, check out the list of commits in the main Rails repository on GitHub or review the CHANGELOG files for the individual Rails components.

  def destroy
    @story = Story.find(params[:id])
    @story.destroy
---
SELECT * FROM "stories" WHERE ("stories"."id" = 1)
DELETE FROM "stories" WHERE "id" = 1