app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("updated_at", "crypted_password", "username", "password_salt", "admin", "persistence_token", "email", "created_at") VALUES('2009-05-15 14:32:39', '98929c441cac65ecde206069920bf54aaea885a81ff9bf7463a0690009c51c2e86b22df6e689c4e4137c8fd382f0c32342b777d7300b1f1baa4ff8e07994a03a', 'shoaib', 'mltySX1W8qmdH07M8pIQ', NULL, 'c2af47463b54720f4c67b2b16af9f2b0cfb235e2b9bc6541fd84571ac0fc99de0790ca4048deb05c1a52961d2938a1498c08ad9aaf5307486e8678d4f066291b', 'saburq@gmail.com', '2009-05-15 14:32:39')

  def update
    @user = current_user
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "persistence_token" = '35fe1f5ec83dda3a71ce82237bd6d8992213f46de89d6f219e3daa89f286d6831aec28acafb81d32bc744278355b2730bdf6e056412c542e9ce180a83ccdf1b5', "username" = 'Shoaib', "crypted_password" = 'cbe0ca98fb41836ad996e31d6876f8e766f502cad131e1168672482398fb04730b68aee8b88c814aa660675f38eadbefb88b4a80ec8df6ccb1faf3303c0c08e7', "updated_at" = '2009-05-10 23:07:39', "password_salt" = '4RSXOUOJo_1vJg89eIyE' WHERE "id" = 1